Revit 2024 API
ElectricalLoadClassification.PanelEstimatedLabel Property
 The name template for the estimated demand parameter on the load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string PanelEstimatedLabel { get; set; }
Visual Basic
Public Property PanelEstimatedLabel As String
	Get
	Set
Visual C++
public:
property String^ PanelEstimatedLabel {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: panelEstimatedLabel is not a valid globalization format string.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace